# specify a directory to install
cask_args appdir: '/Applications'

tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "phrase/brewed"
tap "teamookla/speedtest"
tap "universal-ctags/universal-ctags"

brew "ack"
brew "ant"
brew "bash"
brew "bash-completion"
brew "bat"
brew "node"
brew "nvm"
brew "bit"
brew "glib"
brew "cash-cli"
brew "circleci"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "ctags", link: false
brew "fzf"
brew "git"
brew "gpgme"

brew "go"
brew "grv"
brew "highlight"
brew "htop"
brew "hub"
brew "imagemagick"
brew "ios-webkit-debug-proxy"
brew "librsvg"
brew "lynx"
brew "mas"
brew "maven"
brew "mutt"
brew "neovim"
brew "pandoc"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "vifm"
brew "vim"
brew "w3m"
brew "watchman"
brew "watson"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "github/gh/gh"
brew "phrase/brewed/phrase"
brew "rigellute/tap/spotify-tui"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "teamookla/speedtest/speedtest"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

# GNU utils
brew "coreutils"
brew "findutils"
brew "gnutls"
brew "gnu-tar"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "grep"
brew "gnu-tar"
brew "gawk"

cask "alacritty"
cask "alfred"
cask "avast-security"
cask "firefox"
cask "hammerspoon"
cask "karabiner-elements"
cask "postman"
cask "react-native-debugger"
cask "skype"
cask "wkhtmltopdf"

mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
